app/controllers/books_controller.rb

INSERT INTO `books` (`title`, `user_id`, `author_id`, `published_date`, `isbn`, `created_at`, `updated_at`) VALUES ('Harry potter', 1, 1, '2019-03-10', '1234567890987654', '2023-09-18 16:58:19', '2023-09-18 16:58:19')
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
---
    def set_book
      @book = Book.find(params[:id])